trevorSribar/tempServoLab/temp.ignore/src_board/servo_drive_BXL_AMC0106_LMG_MD.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28P65x" --part "F28P65x_169NMR" --package "169NMR" --context "CPU1" --product "C2000WARE@5.04.00.00"
 * @v2CliArgs --device "TMS320F28P650SK" --package "169NMR" --variant "TMS320F28P650SK6" --context "CPU1" --product "C2000WARE@5.04.00.00"
 * @versions {"tool":"1.23.0+4000"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const analog           = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1          = analog.addInstance();
const cputimer         = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1        = cputimer.addInstance();
const cputimer2        = cputimer.addInstance();
const dac              = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1             = dac.addInstance();
const device_support   = scripting.addModule("/driverlib/device_support.js");
const epwm             = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const epwm3            = epwm.addInstance();
const epwm4            = epwm.addInstance();
const epwmxbar         = scripting.addModule("/driverlib/epwmxbar.js", {}, false);
const epwmxbar1        = epwmxbar.addInstance();
const eqep             = scripting.addModule("/driverlib/eqep.js", {}, false);
const eqep1            = eqep.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const gpio3            = gpio.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const other            = scripting.addModule("/driverlib/other.js", {}, false);
const other1           = other.addInstance();
const sd               = scripting.addModule("/driverlib/sd.js", {}, false);
const sd1              = sd.addInstance();
const sd2              = sd.addInstance();
const sd3              = sd.addInstance();
const spi              = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1             = spi.addInstance();
const sync             = scripting.addModule("/driverlib/sync.js");
const sysctl           = scripting.addModule("/driverlib/sysctl.js");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                   = "ADCA_CONFIG";
adc1.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc1.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc1.soc0IndependentNameMode = true;
adc1.soc0Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc1.soc0SampleWindow        = 15;
adc1.soc1copyFrom            = "MTR1_IU_ADC";
adc1.soc1IndependentNameMode = true;
adc1.soc0Channel             = "ADC_CH_ADCIN7";
adc1.soc1Channel             = "ADC_CH_ADCIN4";
adc1.soc1Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc1.soc1SampleWindow        = 20;
adc1.soc2IndependentNameMode = true;
adc1.soc2Channel             = "ADC_CH_ADCIN14";
adc1.soc2Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc1.soc2SampleWindow        = 20;
adc1.soc2Name                = "MTR1_VDC";
adc1.soc1Name                = "MTR1_VU";
adc1.soc0Name                = "MTR1_IU";
adc1.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc1.interrupt1SOCSource     = "ADC_INT_TRIGGER_EOC2";
adc1.ppb1IndependentNameMode = true;
adc1.registerInterrupts      = ["1"];
adc1.ppb1Name                = "MTR1_IU_PPB";
adc1.enabledSOCs             = ["ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc1.useInterrupts           = false;

adc2.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc2.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc2.soc0IndependentNameMode = true;
adc2.soc0Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc2.soc0SampleWindow        = 15;
adc2.soc1copyFrom            = "MTR1_IU_ADC";
adc2.soc1IndependentNameMode = true;
adc2.soc0Channel             = "ADC_CH_ADCIN7";
adc2.soc1Channel             = "ADC_CH_ADCIN4";
adc2.soc1Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc2.soc1SampleWindow        = 20;
adc2.soc2IndependentNameMode = true;
adc2.soc2Channel             = "ADC_CH_ADCIN14";
adc2.soc2Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc2.soc2SampleWindow        = 20;
adc2.soc2Name                = "MTR1_VDC";
adc2.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc2.enableInterrupt1        = true;
adc2.interrupt1SOCSource     = "ADC_INT_TRIGGER_EOC2";
adc2.ppb1IndependentNameMode = true;
adc2.registerInterrupts      = ["1"];
adc2.$name                   = "ADCB_CONFIG";
adc2.adcBase                 = "ADCB_BASE";
adc2.soc0Name                = "MTR1_IV";
adc2.soc1Name                = "MTR1_VV";
adc2.ppb1Name                = "MTR1_IV_PPB";
adc2.useInterrupts           = false;
adc2.enabledSOCs             = ["ADC_SOC_NUMBER1"];

adc3.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc3.soc0IndependentNameMode = true;
adc3.soc0Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc3.soc0SampleWindow        = 15;
adc3.soc1copyFrom            = "MTR1_IU_ADC";
adc3.soc1IndependentNameMode = true;
adc3.soc0Channel             = "ADC_CH_ADCIN7";
adc3.soc1Channel             = "ADC_CH_ADCIN4";
adc3.soc1Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc3.soc1SampleWindow        = 20;
adc3.soc2IndependentNameMode = true;
adc3.soc2Channel             = "ADC_CH_ADCIN14";
adc3.soc2Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc3.soc2SampleWindow        = 20;
adc3.soc2Name                = "MTR1_VDC";
adc3.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc3.enableInterrupt1        = true;
adc3.interrupt1SOCSource     = "ADC_INT_TRIGGER_EOC2";
adc3.ppb1IndependentNameMode = true;
adc3.registerInterrupts      = ["1"];
adc3.adcBase                 = "ADCC_BASE";
adc3.$name                   = "ADCC_CONFIG";
adc3.soc0Name                = "MTR1_IW";
adc3.soc1Name                = "MTR1_VW";
adc3.ppb1Name                = "MTR1_IW_PPB";
adc3.useInterrupts           = false;
adc3.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER1"];

const divider6       = system.clockTree["ECATDIV"];
divider6.divideValue = 2;

const divider8       = system.clockTree["EPWMCLKDIV"];
divider8.divideValue = 1;

const mux5       = system.clockTree["DIVSRCSEL"];
mux5.inputSelect = "PLLSYSCLK";

const pinFunction1     = system.clockTree["AUXCLK"];
pinFunction1.XTAL_Freq = 25;

cputimer1.$name         = "CPUTIMER_TimeBase";
cputimer1.emulationMode = "CPUTIMER_EMULATIONMODE_RUNFREE";
cputimer1.startTimer    = true;
cputimer1.timerPeriod   = 200000;

cputimer2.cputimerBase  = "CPUTIMER2_BASE";
cputimer2.$name         = "CPUTIMER_CpuUsage";
cputimer2.emulationMode = "CPUTIMER_EMULATIONMODE_RUNFREE";
cputimer2.startTimer    = true;
cputimer2.timerPeriod   = 4294967295;

dac1.referenceVoltage = "DAC_REF_ADC_VREFHI";
dac1.dacBase          = "DACC_BASE";
dac1.$name            = "MTR1_DAC";
dac1.enableOutput     = true;

