trevorSribar/tempServoLab/temp.ignore/src_board/servo_drive_BXL_AMC0106_LMG_MD.syscfg
eqep1.useCase                    = "CUSTOM";
eqep1.useInterfacePins           = ["EQEP#_A","EQEP#_B","EQEP#_INDEX"];
eqep1.positionCounterMode        = "EQEP_POSITION_RESET_MAX_POS";
eqep1.positionCounterMax         = 3999;
eqep1.latchPositionCounter       = "EQEP_LATCH_UNIT_TIME_OUT";
eqep1.positionIndexEvents        = "EQEP_INIT_RISING_INDEX";
eqep1.swPositionInit             = true;
eqep1.enableModule               = true;
eqep1.captureConfig              = true;
eqep1.capPrescale                = "EQEP_CAPTURE_CLK_DIV_128";
eqep1.evntPrescale               = "EQEP_UNIT_POS_EVNT_DIV_32";
eqep1.enableCapture              = true;
eqep1.enableUnitTimer            = true;
eqep1.unitTimerPeriod            = 20000;
eqep1.enableInterrupt            = true;
eqep1.interruptSources           = ["EQEP_INT_UNIT_TIME_OUT"];
eqep1.emulationMode              = "EQEP_EMULATIONMODE_RUNFREE";
eqep1.$name                      = "MTR1_QEP";
eqep1.eqep.$assign               = "EQEP1";
eqep1.eqep.eqep_aPin.$assign     = "GPIO20";
eqep1.eqep.eqep_bPin.$assign     = "GPIO21";
eqep1.eqep.eqep_indexPin.$assign = "GPIO23";
eqep1.aQual.qualMode             = "GPIO_QUAL_3SAMPLE";
eqep1.bQual.qualMode             = "GPIO_QUAL_3SAMPLE";
eqep1.indexQual.qualMode         = "GPIO_QUAL_3SAMPLE";

gpio1.$name           = "MTR1_PM_nFAULT";
gpio1.padConfig       = "PULLUP";
gpio1.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio1.gpioPin.$assign = "GPIO133";

gpio2.$name             = "LAUNCHPAD_LED1";
gpio2.writeInitialValue = true;
gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.gpioPin.$assign   = "GPIO13";

gpio3.$name             = "ISR_MEASURE_IO";
gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.writeInitialValue = true;
gpio3.gpioPin.$assign   = "GPIO25";

inputxbar_input1.$name         = "MTR1_PM_nFAULT_IN";
inputxbar_input1.inputxbarLock = true;
inputxbar_input1.inputxbarGpio = "GPIO133";

other1.useCase                   = "CUSTOM";
other1.useInterfacePins          = ["ADCSOCAO"];
other1.$name                     = "ADCSOCA0_pin";
other1.other.adcsocaoPin.$assign = "GPIO12";

sd1.Use_FilterChannel_4           = true;
sd1.Ch4_DataFilterEnable          = true;
sd1.Ch4_DOSR                      = 64;
sd1.Ch4_SDSYNC_Enable             = true;
sd1.Ch4_SDSYNC_source             = "SDFM_SYNC_PWM5_SOCA";
sd1.useInterrupts                 = true;
sd1.registerInterrupts            = ["INT_SDFM_DR4"];
sd1.useCase                       = "CUSTOM";
sd1.useInterfacePins              = ["SD#_C4","SD#_D4"];
sd1.Ch4_Vclipping                 = 0.064;
sd1.Ch4_FIFO_Enable               = true;
sd1.SDFFINT                       = ["FILTER4"];
sd1.Ch4_DataFilter_Representation = "SDFM_DATA_FORMAT_16_BIT";
sd1.Ch4_FFSYNCCLREN               = true;
sd1.Ch4_SDFFIL                    = "3";
sd1.$name                         = "MTR1_SDFM_IW";
sd1.sdfmIntDr4.enableInterrupt    = true;
sd1.sdfmIntDr4.interruptHandler   = "motor1CtrlISR";
sd1.sd.$assign                    = "SD4";
sd1.sd.sd_c4Pin.$assign           = "GPIO42";
sd1.sd.sd_d4Pin.$assign           = "GPIO43";
sd1.c4Qual.qualMode               = "GPIO_QUAL_ASYNC";
sd1.d4Qual.qualMode               = "GPIO_QUAL_ASYNC";

sd2.$name                         = "MTR1_SDFM_IV";
sd2.Use_FilterChannel_1           = true;
sd2.Ch1_DataFilterEnable          = true;
sd2.Ch1_DOSR                      = 64;
sd2.Ch1_DataFilter_Representation = "SDFM_DATA_FORMAT_16_BIT";
sd2.Ch1_SDSYNC_Enable             = true;
sd2.Ch1_SDSYNC_source             = "SDFM_SYNC_PWM5_SOCA";
sd2.useCase                       = "CUSTOM";
sd2.useInterfacePins              = ["SD#_C1","SD#_D1"];
sd2.Ch1_Vclipping                 = 0.064;
sd2.Ch1_FIFO_Enable               = true;
sd2.Ch1_SDFFIL                    = "3";
sd2.Ch1_FFSYNCCLREN               = true;
sd2.sd.$assign                    = "SD3";
sd2.sd.sd_c1Pin.$assign           = "GPIO105";
sd2.sd.sd_d1Pin.$assign           = "GPIO104";
sd2.c1Qual.qualMode               = "GPIO_QUAL_ASYNC";
sd2.d1Qual.qualMode               = "GPIO_QUAL_ASYNC";

sd3.Use_FilterChannel_1           = true;
sd3.Ch1_DataFilterEnable          = true;
sd3.Ch1_DOSR                      = 64;
sd3.Ch1_DataFilter_Representation = "SDFM_DATA_FORMAT_16_BIT";
sd3.Ch1_SDSYNC_Enable             = true;
sd3.Ch1_SDSYNC_source             = "SDFM_SYNC_PWM5_SOCA";
sd3.useCase                       = "CUSTOM";
sd3.useInterfacePins              = ["SD#_C1","SD#_D1"];
sd3.Ch1_Vclipping                 = 0.064;
sd3.Ch1_FIFO_Enable               = true;
sd3.Ch1_SDFFIL                    = "3";
sd3.Ch1_FFSYNCCLREN               = true;
sd3.$name                         = "MTR1_SDFM_IU";
sd3.sd.$assign                    = "SD1";
sd3.sd.sd_c1Pin.$assign           = "GPIO17";
sd3.sd.sd_d1Pin.$assign           = "GPIO16";
sd3.c1Qual.qualMode               = "GPIO_QUAL_ASYNC";
sd3.d1Qual.qualMode               = "GPIO_QUAL_ASYNC";

spi1.mode                    = "SPI_MODE_CONTROLLER";
spi1.bitRate                 = 4000000;
spi1.txFifo                  = "SPI_FIFO_TX4";
spi1.rxFifo                  = "SPI_FIFO_RX4";
spi1.useCase                 = "CUSTOM";
spi1.useInterfacePins        = ["SPI@_CLK","SPI@_PICO","SPI@_PTE"];
spi1.emulationMode           = "SPI_EMULATION_FREE_RUN";
spi1.$name                   = "DAC_SPI";
spi1.spi.spi_picoPin.$assign = "GPIO91";
spi1.spi.spi_clkPin.$assign  = "GPIO93";
spi1.spi.spi_ptePin.$assign  = "GPIO94";
spi1.clkQual.$name           = "myGPIOQUAL1";
spi1.picoQual.$name          = "myGPIOQUAL0";
spi1.pteQual.$name           = "myGPIOQUAL2";

sync.ADCSOCAOutputSelect = ["SYSCTL_ADCSOC_SRC_PWM5SOCA"];

sysctl.selType_SYSCTL_SDFMTYPE     = true;
sysctl.selTypeLock_SYSCTL_SDFMTYPE = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog.$suggestSolution                   = "ANALOG";
analog1.analog["a14/b14/c14Pin"].$suggestSolution = "A14/B14/C14";
analog1.analog["a15/b15/c15Pin"].$suggestSolution = "A15/B15/C15";
analog1.analog.a4Pin.$suggestSolution             = "A4";
analog1.analog["b1/dacc_outPin"].$suggestSolution = "B1/DACC_OUT";
analog1.analog["b4, gpio215Pin"].$suggestSolution = "B4, GPIO215";
analog1.analog["c4, gpio205Pin"].$suggestSolution = "C4, GPIO205";
other1.other.$suggestSolution                     = "OTHER";
spi1.spi.$suggestSolution                         = "SPID";
